STMicroelectronics/x-cube-azrtos-h7/Projects/STM32H735G-DK/Applications/FileX/Fx_NoR_Write_Read_File/FileX/App/app_filex.h

/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    app_filex.h
  * @author  MCD Application Team
  * @brief   FileX applicative header file
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020-2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __APP_FILEX_H__
#define __APP_FILEX_H__

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "fx_api.h"
#include "fx_stm32_levelx_nor_driver.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stdio.h"
#include "string.h"
#include "stm32h7xx.h"
#include "fx_stm32_levelx_nor_driver.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
UINT MX_FileX_Init(VOID *memory_ptr);
/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
/* Main thread Name */
#ifndef FX_APP_THREAD_NAME
  #define FX_APP_THREAD_NAME "FileX app thread"
#endif

/* Main thread time slice */
#ifndef FX_APP_THREAD_TIME_SLICE
  #define FX_APP_THREAD_TIME_SLICE TX_NO_TIME_SLICE
#endif

/* Main thread auto start */
#ifndef FX_APP_THREAD_AUTO_START
  #define FX_APP_THREAD_AUTO_START TX_AUTO_START
#endif

/* Main thread preemption threshold */
#ifndef FX_APP_PREEMPTION_THRESHOLD
  #define FX_APP_PREEMPTION_THRESHOLD FX_APP_THREAD_PRIO
#endif

/* fx nor_ospi volume name */
#ifndef FX_NOR_OSPI_VOLUME_NAME
  #define FX_NOR_OSPI_VOLUME_NAME "STM32_NOR_OSPI_FLASH_DISK"
#endif

/* fx nor_ospi number of bytes per sector */
#ifndef FX_NOR_OSPI_SECTOR_SIZE
  #define FX_NOR_OSPI_SECTOR_SIZE 512
#endif

/* fx nor_ospi number of FATs */
#ifndef FX_NOR_OSPI_NUMBER_OF_FATS
  #define FX_NOR_OSPI_NUMBER_OF_FATS 1
#endif

/* fx nor_ospi Hidden sectors */
#ifndef FX_NOR_OSPI_HIDDEN_SECTORS
  #define FX_NOR_OSPI_HIDDEN_SECTORS 0
#endif

/* USER CODE BEGIN PD */
#define LED1_GPIO_PORT                   GPIOC
#define LED1_PIN                         GPIO_PIN_3

#define LED2_GPIO_PORT                   GPIOC
#define LED2_PIN                         GPIO_PIN_2
/* USER CODE END PD */

/* USER CODE BEGIN 1 */

/* USER CODE END 1 */
#ifdef __cplusplus
}
#endif
#endif /* __APP_FILEX_H__ */
